# Why use sql in pandas?

SQL in Pandas provides a convenient and familiar way to work with data, especially when dealing with large datasets or when the data is stored in a relational database. It offers a powerful and efficient toolset for data manipulation and analysis.

# How to use pandasql ?

The pandasql Python library allows querying pandas dataframes by running SQL commands without having to connect to any SQL server. Under the hood, it uses SQLite syntax, automatically detects any pandas dataframe, and treats it as a regular SQL table.

`pandasql Syntax`

* sqldf(query, env=None)

In [1]:
! pip install pandasql

Defaulting to user installation because normal site-packages is not writeable

[notice] A new release of pip is available: 23.2 -> 23.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

Requirement already satisfied: pandasql in c:\users\ashmi\appdata\roaming\python\python311\site-packages (0.7.3)
Requirement already satisfied: numpy in c:\python311\lib\site-packages (from pandasql) (1.24.3)
Requirement already satisfied: pandas in c:\users\ashmi\appdata\roaming\python\python311\site-packages (from pandasql) (2.1.3)
Requirement already satisfied: sqlalchemy in c:\users\ashmi\appdata\roaming\python\python311\site-packages (from pandasql) (2.0.23)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\ashmi\appdata\roaming\python\python311\site-packages (from pandas->pandasql) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\python311\lib\site-packages (from pandas->pandasql) (2023.3)
Requirement already satisfied: tzdata>=2022.1 in c:\python311\lib\site-packages (from pandas->pandasql) (2023.3)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\ashmi\appdata\roaming\python\python311\site-packages (from sqlalchemy->pandasql) (4.8.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\ashmi\appdata\roaming\python\python311\site-packages (from sqlalchemy->pandasql) (3.0.1)
Requirement already satisfied: six>=1.5 in c:\python311\lib\site-packages (from python-dateutil>=2.8.2->pandas->pandasql) (1.16.0)

In [2]:
# import the pandas with pandasql
from pandasql import sqldf
import pandas as pd

In [3]:
df = pd.read_csv('csv_data/penguins.csv')
df.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE

# Extracting 5 species and island data

In [4]:
# in Sql
sqldf('''SELECT species,island FROM df LIMIT 5''')

  species     island
0  Adelie  Torgersen
1  Adelie  Torgersen
2  Adelie  Torgersen
3  Adelie  Torgersen
4  Adelie  Torgersen

In [5]:
# In pandas
df[['species','island']].head()

  species     island
0  Adelie  Torgersen
1  Adelie  Torgersen
2  Adelie  Torgersen
3  Adelie  Torgersen
4  Adelie  Torgersen

In [6]:
# check the types
type(sqldf('''SELECT species,island FROM df LIMIT 5'''))

pandas.core.frame.DataFrame

# Extracting unique values from a species column.

In [7]:
# IN sql
sqldf('''SELECT DISTINCT species FROM df''')

     species
0     Adelie
1  Chinstrap
2     Gentoo

In [8]:
# In pandas
df['species'].unique()

array(['Adelie', 'Chinstrap', 'Gentoo'], dtype=object)

# Sorting data

In [9]:
# sorting data in the disacending order
sqldf(''' SELECT body_mass_g FROM df ORDER BY body_mass_g DESC LIMIT 5''')

   body_mass_g
0       6300.0
1       6050.0
2       6000.0
3       6000.0
4       5950.0

In [10]:
df.head(2)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE

In [11]:
df['body_mass_g'].sort_values(ascending=False).head()

237    6300.0
253    6050.0
297    6000.0
337    6000.0
331    5950.0
Name: body_mass_g, dtype: float64

# extracting the unique species of penguins who are males and who have flipper longer than 210 mm.

In [12]:
df.head(2)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE

In [13]:
df.loc[df.flipper_length_mm >= 210]

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
129,Adelie,Torgersen,44.1,18.0,210.0,4000.0,MALE
189,Chinstrap,Dream,52.0,20.7,210.0,4800.0,MALE
192,Chinstrap,Dream,49.0,19.5,210.0,3950.0,MALE
199,Chinstrap,Dream,49.0,19.6,212.0,4300.0,MALE
218,Chinstrap,Dream,50.8,19.0,210.0,4100.0,MALE
...,...,...,...,...,...,...,...
338,Gentoo,Biscoe,47.2,13.7,214.0,4925.0,FEMALE
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE

In [14]:
sqldf('''SELECT * FROM df WHERE sex = 'MALE' AND flipper_length_mm >=210''')

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,44.1,18.0,210.0,4000.0,MALE
1,Chinstrap,Dream,52.0,20.7,210.0,4800.0,MALE
2,Chinstrap,Dream,49.0,19.5,210.0,3950.0,MALE
3,Chinstrap,Dream,49.0,19.6,212.0,4300.0,MALE
4,Chinstrap,Dream,50.8,19.0,210.0,4100.0,MALE
...,...,...,...,...,...,...,...
59,Gentoo,Biscoe,51.5,16.3,230.0,5500.0,MALE
60,Gentoo,Biscoe,55.1,16.0,230.0,5850.0,MALE
61,Gentoo,Biscoe,48.8,16.2,222.0,6000.0,MALE
62,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
63,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE

In [15]:
# extract the no.of species whose flipper length is more than 210 mm
species_df=df.loc[df['flipper_length_mm'] > 210].species.value_counts()
species_df

species
Gentoo       99
Chinstrap     1
Name: count, dtype: int64

In [16]:
df[(df['sex'] == 'MALE') & (df['flipper_length_mm'] > 210)]['species'].unique()

array(['Chinstrap', 'Gentoo'], dtype=object)

# find the longest bill for each species in the dataframe.

In [17]:
sqldf('''SELECT species, MAX(bill_length_mm) FROM df GROUP BY species''')

     species  MAX(bill_length_mm)
0     Adelie                 46.0
1  Chinstrap                 58.0
2     Gentoo                 59.6

In [18]:
df.groupby(['species']).bill_length_mm.max()

species
Adelie       46.0
Chinstrap    58.0
Gentoo       59.6
Name: bill_length_mm, dtype: float64

# find an average whose body mass is more female or male in each species?

In [19]:
sqldf(''' SELECT sex, species, AVG(body_mass_g) FROM df GROUP BY sex,species''')

      sex    species  AVG(body_mass_g)
0    None     Adelie       3540.000000
1    None     Gentoo       4587.500000
2  FEMALE     Adelie       3368.835616
3  FEMALE  Chinstrap       3527.205882
4  FEMALE     Gentoo       4679.741379
5    MALE     Adelie       4043.493151
6    MALE  Chinstrap       3938.970588
7    MALE     Gentoo       5484.836066

In [20]:
df.groupby(['sex','species']).body_mass_g.mean()

sex     species
FEMALE  Adelie       3368.835616
        Chinstrap    3527.205882
        Gentoo       4679.741379
MALE    Adelie       4043.493151
        Chinstrap    3938.970588
        Gentoo       5484.836066
Name: body_mass_g, dtype: float64

* Every species male has an more body mass

In [21]:
sqldf(''' SELECT sex island, AVG(flipper_length_mm) FROM df GROUP BY sex,island''')

   island  AVG(flipper_length_mm)
0    None              215.750000
1    None              179.000000
2    None              187.250000
3  FEMALE              205.687500
4  FEMALE              190.016393
5  FEMALE              188.291667
6    MALE              213.289157
7    MALE              196.306452
8    MALE              194.913043